IDEA StatiCa Open Model
BoltAssembly.HeadDiameter Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Diameter of the head
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double HeadDiameter { get; set; }
Public Property HeadDiameter As Double
	Get
	Set
public:
property double HeadDiameter {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
BoltAssembly Class
IdeaRS.OpenModel.Material Namespace